choose_model = 'B';

switch choose_model
    case 'A'
        %数值算例原模型
        NN=filt([1],[1 -0.8899]);
        TT=filt(0.6299,[1 -0.8899]);
        d=3;
        N=NN;
        T=TT*filt([zeros(1,d) 1],1);
        disp('数值算例原模型');
    case 'B'
        %工业实例原模型
        NN=filt([0.045],[1 -0.93]);
        TT=filt(0.4866,[1 -0.5134]);
        d=6;
        N=NN;
        T=TT*filt([zeros(1,d) 1],1);
        disp('工业实例原模型');
    case 'C'
      %数值算例1(估计值)
        NN=filt([1.01 -0.0297],[1 -0.924 0.0320]);
        TT=filt([0.6282 0.1882 0.2092 -0.01687],[1 -0.5742 0.04330 -0.3020]);
        d=3;
        N=NN;
        T=TT*filt([zeros(1,d) 1],1);%加上时延
        disp('数值算例1(估计值)');
    case 'D'
       %工业实例2(估计值)
        NN=filt([0.0453 -0.00868],[1 -1.12 0.185 0 0 -0.671*1e-4 0 0 7.39*1e-4 14.3*1e-4]);
        TT=filt([0.4797 -0.04317 0.01311 -0.01832],[1 -0.6183 0.08797 -0.05961]);
        d=6;
        N=NN;
        T=TT*filt([zeros(1,d) 1],1);
        disp('工业实例2(估计值)');
    otherwise
        disp('无效的模型');
end
